Repository: GamemakerChina/GMS2_manual_en2ch
Catalog: tm/5pice_ceshi-omegat.tmx
Source language: en_us
Languages: zh_cn

source: Depth can also be changed in-game as it has its own variable that can be changed and manipulated by actions or in code.
zh_cn: 深度是一个变量，可以通过动作或者代码在游戏中改变它。

source: Description
zh_cn: 描述

source: Destroys the surface, freeing it from memory.
zh_cn: 销毁表面层，释放内存。

source: Developer Services Portal integration for in-app purchases, advertising and analytics
zh_cn: 开发者服务门户整合内购、广告和分析

source: Display
zh_cn: 显示

source: Distributing Your Game
zh_cn: 发布您的游戏

source: Distribution
zh_cn: 发布

source: Division and Modulo
zh_cn: 整除与取模（求余）

source: Dots per inch (DPI) is a measure of spatial printing or video dot density, in particular the number of individual dots that can be placed in a line within the span of 1 inch (2.54 cm).
zh_cn: 每英寸打印的点数（DPI）是空间印刷或者视频点密度的量度，特别是指放置在一英寸（2.54 cm）直线跨度内的独立点的数目。

source: Double clicking on a resource in quick succession will automatically open its properties form where you can edit and change things related to it.
zh_cn: 双击将会打开资源的属性界面，你可以编辑和修改相关的设置。

source: Draw GUI begin event
zh_cn: Draw GUI begin 事件

source: Draw GUI end event
zh_cn: Draw GUI end 事件

source: Draw GUI event
zh_cn: Draw GUI 事件

source: Draw begin event
zh_cn: Draw begin 事件

source: Draw end event
zh_cn: Draw end 事件

source: Draw event
zh_cn: Draw 事件

source: Draw the surface in the Draw GUI event of an instance, since the GUI layer is independent of views.
zh_cn: 既然GUI层是独立出视野的，那么可以在一个实例的GUI事件中绘制表面。

source: Drawing
zh_cn: 绘制

source: Drawing And Display
zh_cn: 绘制和显示

source: During the game, the sprite of a particular instance of any object can be changed, so a character can look different when it walks to the left or to the right, for example.
zh_cn: 在游戏期间，对任何物体的特定实例的精灵都是可以改变的，所以可以看到角色在不同的时候往左或者往右走。

source: Each of the individual targets has their own settings and you must ensure that they are correctly configured in the Global Game Settings and Preferences before you continue.
zh_cn: 每一个类型都在 Global game settings(游戏全局设置) 和 Preferences(配置) 里有单独的设置。

source: Each room can have a special "create event" specific for that room.
zh_cn: 每个房间都有特定的“创建事件”。

source: Each tab is split into three parts:
zh_cn: 每个选项卡都有三个部分:

source: Each target option saves to a platform specific format:
zh_cn: 每个目标平台都有一些特殊的格式:

source: Each view also has its own associated view port.
zh_cn: 每个视野都有关联的视口（视见区域）.

source: Editing Backgrounds
zh_cn: 编辑背景

source: Editing the background can be done within GameMaker: Studio too, and we have a whole section in the Advanced Use part of the manual that deals with this here.
zh_cn: 背景编辑可以在 GameMaker: Studio 内完成。进一步的信息请点击 这里。

source: Either of those will cause the following window to open: As with all resources, you must give a name to your backgrounds for reference within GameMaker: Studio and so you can identify them easily, although you should note that the actual name itself is really just a variable which holds a number that "points" to the resource, in this case a background.
zh_cn: 无论以哪种方式都将打开下面的窗口: 如同所有的资源，你必须为 backgrounds 取一个名字使得 GameMaker: Studio 和你可以轻松地辨认它们,实际上你需要知道在这种情况下真实的名字只是一个包含了大量的 "点" 的变量资源。

source: Either option will open a save window where you can give the final name that you wish to use for your game file.
zh_cn: 两者都会打开保存窗口，在这里你可以选择文件名。

source: Either will cause the following window to open:
zh_cn: 打开下面的窗口:

source: Enable a new view and draw the surface only in that view (using view_current to check which view is being drawn)
zh_cn: 启用一个新的视野，在新视野中绘制表面（使用 view_current 检测正在绘制哪个视野）。

source: Enable or disable the automatic drawing of the application surface.
zh_cn: 是否允许应用表面层的自动绘制。

source: Enable or disable the use of the application surface.
zh_cn: 启用或禁用应用表面层。

source: Enjoy the experience!
zh_cn: 尽情享受吧！

source: Equally, you can set the Spd to 150% and the instance will accelerate as it reaches the point.
zh_cn: 同样的，你可以将 Sp 值设置为150，那么这会让实例的运动速度变快。

source: Evaluation Order
zh_cn: 求值顺序

source: Even though this is not strictly required, you are strongly advised to use only letters and digits and the underscore symbol (_) in a name of a sprite (and any other resource) and to let it start with a letter, not a number as this will become very important once you start using code.
zh_cn: 尽管不是强烈要求，但是建议你仅使用字母、数字和下划线为它们命名，并且第一个字符不能是数字。一旦你开始使用代码，这将变得十分重要。

source: Events
zh_cn: 事件

source: Events and actions will be discussed in more detail in following sections of the manual.
zh_cn: 事件和动作的详细信息在手册接下来的部分会提到。

source: Every object in the game can have a parent object, but what does this mean?
zh_cn: 游戏里每个物体都有一个父对，但是那是什么意思？

source: Exactly the same as we would use a normal variable, as shown by the following examples:
zh_cn: 确切的说，和变量的变量没有区别，请看下面的例子：

source: Example :
zh_cn: 例子：

source: Example:
zh_cn: 举例：

source: Examples of use:
zh_cn: 使用的例子：

source: Expressions
zh_cn: 表达式

source: Expressions can be real numbers (e.g. 3.4), hexadecimal numbers starting with a $ sign (e.g. $00FFAA), strings between single or double quotes (e.g. 'hello' or "hello") or more complicated expressions.
zh_cn: 表达式可以是实数数字（比如3.4），或者“$”开始的十六进制数字（$00FFAA），或者是单引号、双引号之间的字符串（'hello'或者"hello"者），或者更复杂的表达式。

source: Extended Example
zh_cn: 扩展示例：

source: Extended Example:
zh_cn: 扩展示例：

source: Extension Packages
zh_cn: 扩展包

source: External Editor
zh_cn: 外部编辑器

source: Extras
zh_cn: 其它

source: Failure to do so can cause memory leaks which will eventually slow down and crash your game.
zh_cn: 如果不这样做，可能会导致内存泄漏，最终放慢游戏甚至游戏崩溃。

source: File Handling
zh_cn: 文件处理

source: Finally it clears the old grid so that all cells have a value of -1.
zh_cn: 最终清空旧栅格以便所有单元格都承载值-1.

source: Finally the surface is assigned to a view.
zh_cn: 最后，给这个表面图层指定给一个视野。

source: Finally, on the left of the player is the "Workshop" button and the "Back" button.
zh_cn: 最后，播放器左边的是 "Workshop" 按钮和 "Back" 按钮。

source: Finally, once confirmed, you will be given the new license and an email with it will be sent to the address you have given.
zh_cn: 最后一旦确认，你将获得一份新的许可证和邮件，并发送到你提供的邮箱里。

source: Finally, you can reset the GUI layer using this function by setting the scaling factors to -1.
zh_cn: 最后，你可以尝试将将缩放因数设置为-1，重置GUI层。

source: Finally, you can specify the connection kind and whether the path should be closed or not (a closed path will connect the last point on the path with the first).
zh_cn: 最后，你可以指定路径的连接方式以及路径是否需要闭合（一条闭合的路径会将路径的起始点和结束点连接起来）。

source: Find the overlapping region of the rectangle defined by (x1,y1) to (x2,y2) on each of the attached displays.
zh_cn: 查找 (x1,y1) 到 (x2,y2)矩形范围内的每个附加显示器的重叠区域。

source: Finds the pixel height of a surface.
zh_cn: 查询表面层的像素高度。

source: Finds the pixel width of a surface.
zh_cn: 获取一个表面的像素宽度。

source: Finds whether a given surface exists or not.
zh_cn: 查询给定的表面是否存在。

source: First of all, for all your resources (sprites, objects, sounds, etc...) you must use names that start with a letter and only consist of letters, digits and the underscore '_' symbol (for example "spr_Fish" is acceptable but not "spr Fish" or "6fish") otherwise you will not be able to refer to them with any GML functions.
zh_cn: 首先，对于资源列表（精灵、物体、声音等），必须以字母开头，并且只能用字母、数字和下划线（比如允许"spr_Fish"，但不允许"spr Fish"或者"6fish"），否则无法在任何GML函数中使用。

source: First of all, most objects, when placed as instances within a room, need some image to make them visible on the screen.
zh_cn: 首先大多数物体作为实例放置在房间里，需要一些图片使得它们在屏幕上可见。

source: First of all, you don't want others to be able to change the game or get access to all your hard work, and secondly you also want people to play the game even if they do not have a copy of GameMaker: Studio.
zh_cn: 首先，你不希望别人能够改变游戏或得到你所有的辛勤工作，其次你也希望即使别人没有 GameMaker: Studio 也可以玩你的游戏。

source: First the expression is executed.
zh_cn: 首先括号里面的运行表达式

source: First we create the array we want to use, and then we pass that array to the script:
zh_cn: 首先创建将要使用的数组，然后传递给脚本：

source: First we should initialize the array we are going to use in the create event of our "controller" object:
zh_cn: 首先，我们应该在“控制器”物体的创建事件中初始化即将使用数组：

source: First you have to choose the "target" for the files to be made which means choosing whether you wish to create an *.exe for Windows, generate JavaScript and HTML for use in a browser, or create a package for one of the other target modules.
zh_cn: 首先你要在 "target" 里选择到底需要生成什么类型的文件，

source: First, you should realise that surfaces (except the application surface) are "volatile".
zh_cn: 首先，应该认识到表面层（除了 应用表面层）是“不稳定的 ” are "volatile".

source: Fonts
zh_cn: 字体

source: For 8 and 4 it will report 12.
zh_cn: 对于 8 和 4 的支持它会输出12。

source: For Android devices, a *.apk file will be generated which can be used directly on any Android devices or uploaded to the Google Play or Amazon stores (or any other site that accepts Android apps).
zh_cn: 选择了安卓设备，就会生成 *.apk 文件，你可以直接在任何 Android 设备上使用，或者上传到 Google Play 或 Amazon stores (或任意接受 Android 应用程序的网站)。

source: For a more in-depth look at the sprite editor in GameMaker: Studio, as well as details on the SWF and JSON formats, you can go to the Advanced Section of this manual.
zh_cn: 更深入地了解 GameMaker: Studio 的 sprite editor 以及 SWF 和 JSON 格式的详情，可以到本手册的 高级部分 浏览相关内容。

source: For all 3 levels (2,4 and 8) it will report 14.
zh_cn: 支持所有三个等级时 （2、4 和 8）将出输出14。

source: For all available platforms, once you have done the necessary set-up, when the game is run on a device it will register that device with the platforms push notification service.
zh_cn: 在所有支持的平台上， 一旦你完成了必要的设置， 游戏在设备上运行时会自动 注册 对应平台的推送通知服务。

source: For an explanation of vectors and normalised vectors you can read the following two sections which give a brief overview of what is a vector and how it can be used in making games:
zh_cn: 为了解释一下向量和规范化向量，你可以阅读下面两个章节，提供了关于什么是向量以及在制作游戏过程中如何使用它们的一个简短的概述：

source: For an iOS or Mac build you will need all the appropriate developer permissions and an Apple Mac computer.
zh_cn: 生成 iOS 或 Mac 应用软件需要 苹果开发者许可和一台苹果 MAC 电脑。

source: For an object to actually do something, we need to give it actions, but we also need to tell it when to complete these actions.
zh_cn: 当我们需要一个物体做 什么的时候，我们需要给它动作，而且还需要告诉它什么时候完成这些动作。

source: For each font resource you specify a particular type of font from your computer which can then be used in your game using the action or code to set a font for drawing to the screen.
zh_cn: 每一个字体资源你需要指定你电脑里已有的一款字体，然后你就可以在你的游戏中通过 动作 或者 代码 来指定一个用来绘制的字体。

source: For each visible view, or, if no views are active, once
zh_cn: 为每个可见的视野执行一次下述序列，如果激活的视野，仅执行一次

source: For editing backgrounds, GameMaker: Studio has its own included Image Editor which is quite powerful, although not as complete as many dedicated art packages available.
zh_cn: GameMaker: Studio 内置了强大的图像编辑器，尽管并不是万能的。

source: For example if you have a script that takes two arguments and you only supply one then you will get an error for that script.
zh_cn: 比如你有一个脚本需要两个参数，而你只是提供了一个参数，这样就会报错。

source: For example if you have moments at timesteps 5, 8, and 12 and you indicate as range 5:12 and a percentage 200, the moments will move to time steps 5, 11, and 19 (the intervals between them have doubled.) When different moments become the same their action lists will be merged.
zh_cn: 举例来说，在时刻5、8、12处分别有一些动作，然后你指定了起止时刻5至12以及200%的伸缩，那么这三个时刻会被分别移动至时刻5、11、19处（这些时刻之间的间隔翻了一倍）。同样，当时刻之间出现重叠，那么它们的动作会被合并。

source: For example, an image file with the name ball_strip4.png is assumed to contain 4 subimages and will be split up as such when loaded.
zh_cn: 例如，一个图像名为 ball_strip4.png 被假定为包含4个子图像，并且在加载时拆分。

source: For example, consider the following code:
zh_cn: 例如，考虑下面的代码：

source: For example, if you have a 200 x 150 pixel window, and the player stretches the window by dragging the borders, the final window size may be 400 x 300 pixels, but the drawing canvas is STILL 200 x 150, which gives a blurred image as the pixel ratio is now 1:2.
zh_cn: 比如，你的窗口是 200 x 150 像素，玩家拖动边界拉伸窗口，最后窗口可能会是400 x 300 像素，但是绘制画布仍然是 200 x 150，因为像素缩放比例为1:2，图像变得模糊。

source: For example, if you have a view height of 240 and set the vertical view border to 120, the object that the view must follow will always be in the middle of the view.
zh_cn: 比如，你的视野高度是 240，设置纵向视野边界为120，视野跟随的物体将会一直保持在视野的中心。

source: For example, if you have a view width of 320 and set the horizontal view border to 160, the object that the view must follow will always be in the middle of the view.
zh_cn: 比如，你的视野宽度是 320，设置横向视野边界为160，视野跟随的物体将会一直保持在视野的中心。

source: For example, if you have a view-sized surface and wish to draw something that is currently in view to that surface, you should subtract the view x and y coordinates from the actual x and y coordinates to get a relative position to the surface (0,0) position.
zh_cn: 例如，如果你有一个视野尺寸大小的表面，并希望在当前视野上往表面里绘制一些东西，你应该从实际的X/Y坐标减去视角的X/Y坐标，得到表面（ 0,0）的相对位置

source: For example, if you make an isometric game, objects typically have a height (to give them a 3D view), but for collisions you only want to use the "feet" part of the sprite.
zh_cn: 例如，如果你要制作一个等轴测游戏，物体通常有一个高度 (给他们一个 3D 视角)，但是你只想使用精灵的 "脚" 部分来进行碰撞。

source: For example, if you require further information on advertising, simply typing "ads" into this search box and hitting "Enter" will take you to the following page: List Of Ads Tutorials.
zh_cn: 例如，如果你需要获得更多关于广告的信息，只需要在搜索框输入 “ads” 并按回车就会带你到如下页面: 广告教程列表

source: For example, the Render State watch cannot be viewed in real time.
zh_cn: 例如，这个渲染状态监视窗口就无法实时观看。

source: For example, the above image could be called bck_Horizon or Horizon_bck.
zh_cn: 例如，上图可以叫做 bck_Horizon 或者 Horizon_bck。

source: For example, the above sky diver sprite could be called spr_SkyDiver or SkyDiver_spr.
zh_cn: 例如，上面的 sprites 可以命名为 spr_SkyDiver 或 SkyDiver_spr。

source: For example, the following 10 images form a sprite for a character who is waving his arms while skydiving.
zh_cn: 例如，下面的十张图片组成的精灵是一个角色在挥舞着手臂。

source: For example, the following program creates five balls at random positions.
zh_cn: 比如说，下面的程序将会在随机位置创建5个球。

source: For example, there is a Create Event that is performed only when the object gets created.
zh_cn: 比如，Create Event (创建事件) 只会在物体被创建时发生。

source: For example, this will not work correctly:
zh_cn: 比如，下面是 不正确的：

source: For example, to add motion to a ball object when we create an instance of it in a room, we would add a motion action to the create event of the object.
zh_cn: 例如，在房间中创建一个运动的球实例需要在球物体的创建事件中添加动作。

source: For example, when the main character meets an enemy he might die or he might fight the enemy and score points.
zh_cn: 例如，当主角遇到敌人，他可能会死，或者他打死敌人获得分数。

source: For example, you can add backgrounds in that can be either a simple colour or an actual image.
zh_cn: 例如，你可以添加 backgrounds (背景) ，可以是单色或者一些图像。

source: For example, you can use surfaces to "catch" instances, which can then be destroyed, and in this way you can create a decal effect where the sprite for the instance is displayed on the surface as if it still existed, permitting graphical effects like debris, blood, etc... without any real processing overhead.
zh_cn: 例如，您可以使用表面来“捕捉”实例，然后摧毁它，并以这种方式，在表面(surfaces)上，实例的精灵显示的位置，创建一个贴花效果，就好像它仍然存在一样，以此来制作一些图像效果，如碎片，血液等.. 这上面没有任何真实的处理进程。

source: For example, you cannot write:
zh_cn: 比如，你不能这样写：

source: For example, you may have two displays with the same resolution of 400 x 800, but display 1 has a dpi of 60 and display 2 has a dpi of 30.
zh_cn: 比如，你可能有两个显示器，它们有相同的分辨率400 x 800，但是显示器1是60dpi，而显示器2是30dpi。

source: For example, you want to have a large walled area in your game, so you would define one wall object and then place multiple instances of that object in your room to create large, complex walled areas.
zh_cn: 例如，你想有一大块墙，需要定义墙物体并且放置多个它的实例，

source: For example:
zh_cn: 比如：

source: For expressions, the following operators exist (in order of priority):
zh_cn: 对于表达式，有下面这些运算符（以优先度排序）：

source: For full details, please see the following page:
zh_cn: 详情请见以下页面：

source: For further details on how to go about setting up a server, as well as information specific to the available platforms, please see the following pages on the YoYo Games Knowledge Base:
zh_cn: 如何搭建一个可用的服务器，或者可用的信息平台,请查看以下页面 YoYo Games 知识库:

source: For further information on how to compile a final game for your target platform, and for details on how to upload these to the various app stores available, please see the YoYo Knowledge Base.
zh_cn: 更多如何生成目标平台最终游戏和上传 app 到应用商店的细节请登陆 YoYo 知识库。

source: For further information on profiling see the section below:
zh_cn: 而概况中更进一步的信息请阅读下方单元：

source: For further information on the returned asynchronous data, please see the function cloud_synchronise.
zh_cn: 想要进一步了解异步函数返回的数据，请查阅函数 cloud_synchronise.

source: For further information on this please see GameMaker: Studio Preferences
zh_cn: 详细情况请查阅 GameMaker: Studio Preferences

source: For further information see Surfaces.
zh_cn: 更多详细信息查阅 表面层。

source: For further information, advice and troubleshooting please consult the YoYo Games Knowledge Base where you will find detailed information of how to setup all platforms for use with GameMaker: Studio.
zh_cn: 更多信息、设备和故障排除请访问 YoYo Games 知识库。在那里您可以找到 GameMaker: Studio 安装所有平台支持的详细信息。

source: For information on how to use it, please see the section More About Sprites: Editing Subimages as there is exactly the same set of tools available for backgrounds as for sprites.
zh_cn: 关于如何使用它，请查看 More About Sprites: Editing Subimages (更多关于精灵: 编辑子图像) 章节。

source: For information on how views can be set up without code directly from the room editor, please see the section More About Rooms - Views.
zh_cn: 无需代码在房间编辑器内设置视野的更多信息，请查看章节More About Rooms - Views.

source: For more details, as well as specific functions for this feature, please see the following section:
zh_cn: 更多具体的内容，以及一些特性函数，请查阅如下的章节：

source: For more information on becoming a registered Apple Developer and how to get the necessary certificates, please visit the Apple Developer site here.
zh_cn: 更多关于注册苹果开发者和如何获得所需的证书请访问 苹果开发者网站

source: For more information on configurations see this section:
zh_cn: 更多信息可以在下面的章节找到:

source: For more information on parents (and other advanced object properties) see More About objects.
zh_cn: 更多有关父对的信息 (和其他高级物体属性) 请查阅 更多关于物体。

source: For more information on scripts please see Advanced Use - Scripts.
zh_cn: 更多关于脚本的内容将查阅高级使用 - 脚本.

source: For more information on this target please see here.
zh_cn: 更多信息请点击 这里.

source: For more information on tiles see the section in the Advanced Use part of the manual More About Backgrounds, and for information on how to use tiles in the room editor you can go to the section More About Rooms.
zh_cn: 更多关于磁贴的使用请查阅本手册的高级部分 更多关于背景，如何在房间编辑器编辑器使用磁贴请查阅 更多关于房间。

source: For more information on window position and window size, see window_set_position and window_set_size.
zh_cn: 更多关于窗口位置和大小的信息，查看 window_set_position 和window_set_size。

source: For more information see here.
zh_cn: 更多信息请查阅 这里。

source: For more information, examples, tutorials, ideas and links to helpful forums and other great sites, check out the website
zh_cn: 更多信息、例子、教程、创意、帮助以及其他有用的链接，请点击下面的网站

source: For other devices it will return 0, and you should use the device_mouse_raw_x and device_mouse_raw_y functions instead.
zh_cn: 其它设备会返回0，这时你应该使用 device_mouse_raw_x和 device_mouse_raw_y 函数替代它。

source: For that reason, you can right-click on any variable value and get a pop-up window that lists the available data-types that this variable could be.
zh_cn: 基于该理由，你在任一变量值上右击就会弹出一个显示它所有可能的数据类型的列表。

source: For that we need the most important resource of GameMaker: Studio, the objects.
zh_cn: 为此我们需要 GameMaker: Studio 中最重要的资源: objects (物体)。

source: For that you need to use game_end().
zh_cn: 如果，你需要使用game_end()。

source: For the Tizen target module, a *.wgt file is generated which can then be used by all compatible devices or uploaded to the Tizen app stores.
zh_cn: •Tizen 模块会生成 *.wgt 文件，可在所有兼容设备上运行或发布到 Tizen 应用商店。

source: For the Windows 8 (JS and Native) module an *.appx file will be created, along with its manifest and a number of other files that are needed for your game to work as a native Windows 8 app.
zh_cn: •Windows 8 (JS 和 本地) 模块会生成 *.appx 文件，还会附带生成一些 win8 app 必须的文件。

source: For the Windows Phone device target module, an *.xap file is generated which can then be used by all compatible devices or uploaded to the MS Store.
zh_cn: •Windows Phone 模块会生成 *.xap 文件，可在所有兼容设备上运行或发布到 MS Store。

source: For this end you use the return statement:
zh_cn: 为了这个目的，使用“return”语句：

source: For this reason GameMaker: Studio has path resources and a dedicated path editor.
zh_cn: 为此， GameMaker: Studio 提供了 路径 资源以及一个专门设计的 路径编辑器。

source: For values smaller than 100 the moments are moved closer together and for values larger than 100 they are moved further apart.
zh_cn: 一个小于100%的值意味着时刻之间的间隔变小了，而一个大于100%的值意味着时刻之间的间隔变长了。

source: For your game to work you will need both of these to be uploaded to a server.
zh_cn: 你需要将整个文件夹 both 上传到服务器。

source: Fourth, when drawing to a surface manually, the surface is always at the position of (0,0).
zh_cn: 第四，手动绘制表面层时，表面 始终 在 (0,0)的位置。

source: From the right click menu that pops up you should select the option View Downloadable Content which will open the application Properties window and there you can select, buy and install the module of your choice.
zh_cn: 从弹出的右键菜单你应该选择 View Downloadable Content (查看可下载内容)，它将打开应用 Properties (属性) 窗口，在哪里可以选择、购买并安装你需要的模块。

source: Function
zh_cn: 函数

source: Function List
zh_cn: 函数列表

source: Functions
zh_cn: 函数

source: Further events include the Keyboard Event (for when the player presses a key), Mouse Event to detect mouse buttons, and the Draw Event which is where we can tell each instance of an object to draw whatever we want.
zh_cn: 进一步地，可以包含 Keyboard Event (键盘事件) (比如玩家按下一个键)、Mouse Event (鼠标事件) (检测鼠标按钮)以及 Draw Event (绘制事件)。

source: Further information on setting up the Android module can be found on the YoYo Games Helpdesk.
zh_cn: 更多关于 Android 模块的信息可以在 YoYo Games 服务台 找到。

source: Further information on setting up the HTML5 module can be found on the YoYo Games Helpdesk.
zh_cn: 建立 HTML5 模块的更多信息可以在 YoYo Games 服务台 找到。

source: Further information on setting up the Mac OS X module can be found on the YoYo Games Helpdesk.
zh_cn: 更多关于 Mac OS X 模块的信息可以在 YoYo Games 服务台 找到。

source: Further information on setting up the Tizen module can be found on the YoYo Games Helpdesk.
zh_cn: 更多关于 Tizen 模块的信息可以在 YoYo Games 服务台 找到。

source: Further information on setting up the Ubuntu module can be found on the YoYo Games Helpdesk.
zh_cn: 更多关于 Ubuntu 模块的信息可以在 YoYo Games 服务台 找到。

source: Further information on setting up the Windows 8 modules can be found on the YoYo Games Helpdesk.
zh_cn: 更多关于 Windows 8 模块的信息可以在 YoYo Games 服务台 找到。

source: Further information on setting up the Windows Phone module can be found on the YoYo Games Helpdesk.
zh_cn: 更多关于 Windows Phone 模块的信息可以在 YoYo Games 服务台 找到。.

source: Further information on setting up the iOS module can be found on the YoYo Games Helpdesk.
zh_cn: 更多关于 iOS 模块的信息可以在 YoYo Games 服务台 找到。

source: Further information on these formats and file creation can be found on the YoYo Knowledge Base.
zh_cn: 有关这些格式和文件创建的详情请查阅 YoYo 知识库。

source: GML Overview
zh_cn: GML 概述

source: Game Assets
zh_cn: 游戏资产

source: Game Information
zh_cn: 游戏信息

source: Game Play
zh_cn: 游戏玩法

source: Game Settings
zh_cn: 游戏设置

source: GameMaker: Studio Professional
zh_cn: GameMaker: Studio 专业版

source: GameMaker: Studio Manual
zh_cn: GameMaker: Studio 手册

source: GameMaker: Studio Overview
zh_cn: GameMaker: Studio 概述

source: GameMaker: Studio comes with a number of export options included when you buy it: Windows and Mac OS X (and Steam Workshop if you bought the program from Steam), as well as Windows 8 (Native) and Windows 8 (JS).
zh_cn: 购买后，GameMaker: Studio 将出现许多导出选项：Windows 和 Mac OSX（如果是从 Steam 购买的程序还会包括 Steam 创意工坊的导出选项），以及Windows 8 (本地) 和 Windows 8 (JS)。

source: Games created with GameMaker: Studio take place in one or more rooms.
zh_cn: GameMaker: Studio 创建的游戏发生在一个或多个 房间 里。
